---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
source: html/f5686f92-0f1e-d515-7b3b-51454c481041.htm
---
# RevitAPIPreEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.